# IFCHybrid Import Options Hybrid Levels Property

Source: https://www.revitapidocs.com/2026/4bbe1187-5254-81aa-adb7-d7093018466f.htm

---

| IFCHybrid Import Options Hybrid Levels Property |
| --- |

True if we should use AnyCAD to process levels, false otherwise.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool HybridLevels { get; }
```

```
Public ReadOnly Property HybridLevels As Boolean
	Get
```

```
public:
property bool HybridLevels {
	bool get ();
}
```

```
member HybridLevels : bool with get
```

#### Property Value

Boolean See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace